IDEA Open Model
CrossSectionFactory.FillCssSteelChannel Method
Compatible with IDEA StatiCa 20.1
 Create steel section Channel shape - steel shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillCssSteelChannel(
	CrossSectionParameter css,
	double B,
	double D,
	double tw,
	double tf,
	double rw,
	double rf,
	double taperF
)
Public Shared Sub FillCssSteelChannel (
	css As CrossSectionParameter,
	B As Double,
	D As Double,
	tw As Double,
	tf As Double,
	rw As Double,
	rf As Double,
	taperF As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
B
Type: System.Double
width
D
Type: System.Double
depth
tw
Type: System.Double
web thickness
tf
Type: System.Double
flange thickness
rw
Type: System.Double
root radius
rf
Type: System.Double
flange edge rounding radius
taperF
Type: System.Double
Flange taper
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace